<template>
  <div class="m-menu">
    <dl class="nav" @mouseleave="leave">
      <dt>全部分类</dt>
      <dd v-for="(item, index) in menu" @mouseenter="enter(index)">
        <i :class="item.type"></i>
        {{item.name}}
        <span class="arrow"></span>
      </dd>
      <div class="detail" v-show="curDetail.length">
        <div v-for="item in curDetail">
          <h4>{{item.title}}</h4>
          <span v-for="v in item.child">{{v}}</span>
        </div>
      </div>
    </dl>
  </div>
</template>

<script>
  export default {
    name: "MyMenu",
    data () {
      return {
        curDetail: [],
        menu: [
          {
            type: 'food',
            name: '美食',
            child: [
              {
                title: '美食',
                child: ['代金券', '甜点饮品', '火锅', '自助餐', '小吃快餐', '日韩料理', '西餐', '聚餐宴请', '烧烤烤肉', '东北菜', '川湘菜', '江浙菜', '香锅烤鱼', '粤港菜', '中式烧烤/烤串', '西北菜', '咖啡酒吧茶馆', '云贵菜', '东南亚菜', '海鲜', '素食', '台湾/客家菜', '创意菜', '汤/粥/炖菜', '蒙餐', '新疆菜', '其他美食', '京菜鲁菜']
              }
            ]
          },
          {
            type: 'takeout',
            name: '外卖',
            child: [
              {
                title: '外卖',
                child: ['美团外卖']
              }
            ]
          },
          {
            type: 'hotel',
            name: '酒店',
            child: [
              {
                title: '酒店星级',
                child: ['经济型', '舒适/三星', '高档/四星', '豪华/五星']
              }
            ]
          },
          {
            type: 'homestay',
            name: '榛果民宿',
            child: [
              {
                title: '热门城市',
                child: ['上海', '成都', '北京', '重庆', '南京', '杭州', '广州', '西安', '大连']
              }
            ]
          },
          {
            type: 'movie',
            name: '猫眼电影',
            child: [
              {
                title: '热映电影',
                child: ['叶问外传：张天志', '蜘蛛侠：平行宇宙', '地球最后的夜晚', '云南虫谷']
              },
              {
                title: '热门影院',
                child: ['金逸影城', '大地影院', '万达影城', '哈艺时尚影城', '星美国际影城']
              }
            ]
          },
          {
            type: 'airport',
            name: '机票 / 火车票',
            child: [
              {
                title: '机票',
                child: ['国内机票', '国际/港澳台机票']
              },
              {
                title: '火车票',
                child: ['火车票']
              }
            ]
          },
          {
            type: 'ktv',
            name: '休闲娱乐 / KTV',
            child: [
              {
                title: '休闲娱乐',
                child: ['足疗按摩', '洗浴/汗蒸', '酒吧', '密室逃脱', '轰趴馆', '茶馆私', '私人影院', 'DIY手工坊', '采摘/农家乐', '网吧网咖', '游乐游艺', 'VR', '桌面游戏', '真人CS']
              },
              {
                title: 'KTV',
                child: ['KTV']
              }
            ]
          },
          {
            type: 'life',
            name: '生活服务',
            child: [
              {
                title: '生活服务',
                child: ['衣物/皮具', '洗护', '家政', '搬家运输', '送水', '充值缴费', '服饰/鞋包', '养护', '开锁换锁', '居家维修', '管道疏通', '家电维修清洗', '电脑维修', '手机维修', '证件照/肖像摄影', '照片冲印/图文文印', '商务服务/法律服务', '文化传媒机构', '成人用品/情趣用品']
              }
            ]
          },
          {
            type: 'hair',
            name: '丽人 / 美发 / 医学美容',
            child: [
              {
                title: '丽人',
                child: ['美发', '美甲美睫', '美容美体', '医学美容', '瑜伽舞蹈', '瘦身纤体', '韩式定妆', '祛痘', '纹身', '化妆品']
              }
            ]
          },
          {
            type: 'marry',
            name: '结婚 / 婚纱摄影 / 婚宴',
            child: [
              {
                title: '结婚',
                child: ['婚纱摄影', '旅拍', '个性写真', '婚宴', '婚庆公司', '婚纱礼服', '西服定制', '婚戒首饰', '婚车租赁', '司仪主持', '彩妆造型', '婚礼跟拍', '婚礼小礼品', '更多婚礼服务']
              }
            ]
          },
          {
            type: 'offspring',
            name: '亲子 / 儿童乐园 / 幼教',
            child: [
              {
                title: '儿童乐园',
                child: ['婴儿游泳', '其它亲子游乐']
              },
              {
                title: '幼儿教育',
                child: ['早教中心', '少儿英语', '智力开发', '托班/幼儿园', '幼儿教育', '其他幼儿教育']
              },
              {
                title: '亲子摄影',
                child: ['儿童摄影', '孕妇写真', '上门拍', '其他亲子摄影']
              },
              {
                title: '孕产护理',
                child: ['月子会所', '产后恢复', '妇幼医院', '孕产用品', '开奶催乳', '月嫂', '亲子购物', '宝宝派对', '亲子服务']
              }
            ]
          },
          {
            type: 'sport',
            name: '运动健身 / 健身中心',
            child: [
              {
                title: '运动健身',
                child: ['健身中心', '武术场馆', '游泳馆', '羽毛球馆', '溜冰场', '射箭馆', '篮球场', '网球馆', '台球馆', '乒乓球', '足球场', '高尔夫场', '保龄球馆', '体育场馆', '马术场', '壁球馆', '更多运动']
              }
            ]
          },
          {
            type: 'furniture',
            name: '家装 / 建材 / 家居',
            child: [
              {
                title: '装修设计',
                child: ['半包装修', '全包装修', '清包装修']
              },
              {
                title: '装修建材',
                child: ['地板', '瓷砖石材', '橱柜', '灯饰照明', '厨卫洁具', '油漆涂料', '集成吊顶', '墙纸墙艺', '门窗', '木材板材', '家用五金', '电工电料', '楼梯', '管材管件']
              },
              {
                title: '家具家居',
                child: ['家具', '床上用品/家纺', '家居饰品', '厨具餐具', '智能家居']
              },
              {
                title: '家装卖场',
                child: ['建材卖场', '家居卖场', '灯饰卖场']
              }
            ]
          },
          {
            type: 'study',
            name: '学习培训 / 音乐培训',
            child: [
              {
                title: '音乐培训',
                child: ['钢琴', '吉他', '小提琴', '古筝', '架子鼓', '声乐', '其他音乐培训']
              },
              {
                title: '职业技术',
                child: ['美容化妆', '会计', 'IT', '厨艺', '管理培训', '摄影培训', '司法考试', '公务员培训', '其他职业培训']
              },
              {
                title: '外语培训',
                child: ['英语', '日语', '韩语', '法语', '德语', '汉语', '俄语', '西班牙语', '其他外语']
              },
              {
                title: '美术培训',
                child: ['绘画', '书法', '其他美术']
              }
            ]
          },
          {
            type: 'health',
            name: '医疗健康 / 宠物 / 爱车',
            child: [
              {
                title: '医疗健康',
                child: ['医院', '齿科口腔', '体检中心', '药店', '中医', '其他健康服务', '', '', '', '', '', ]
              },
              {
                title: '爱车',
                child: ['洗车', '租车', '加油站', '维修保养', '驾校', '汽车美容', '陪练', '汽车用品', '停车场', '汽车保险', '4S店/汽车销售', '更多汽车服务']
              },
              {
                title: '宠物',
                child: ['宠物店', '宠物医院']
              }
            ]
          },
          {
            type: 'bar',
            name: '酒吧 / 密室逃脱',
            child: [
              {
                title: '玩乐',
                child: ['KTV', '酒吧', '密室逃脱', '轰趴馆', '茶馆私', '私人影院', 'DIY手工坊', '采摘/农家乐', '网吧网咖', '游乐游艺', 'VR', '桌面游戏', '真人CS', '其他玩乐']
              }
            ]
          }
        ]
      }
    },
    methods: {
      enter (index) {
        this.curDetail = this.menu[index].child;
      },
      leave () {
        this.curDetail = [];
      }
    }
  }
</script>

<style>
</style>
